---
kind: property
id: P:Autodesk.Revit.DB.Structure.Truss.Members
zh: 桁架
source: html/ac8c1ca8-0d19-706e-403b-3be82c6f082f.htm
---
# Autodesk.Revit.DB.Structure.Truss.Members Property

**中文**: 桁架

Get all the members of truss.

## Syntax (C#)
```csharp
public ICollection<ElementId> Members { get; }
```

## Returns
The Members property returns an ElementIdSet
that contains all the member Ids of truss.